[
    {
        "display": true,
        "organization_title": "Patrick Murphy Webdesign &amp; Photography",
        "organization_img": "images/patrickmurphy_logo.png",
        "type": "Freelance",
        "jobs": [
            {
            "job_title": "Freelance Web developer",
            "job_start": 2005,
            "job_end": "Present",
            "job_description": "I develop websites for various small businesses and individuals.  In 2009, I began offering professional Photography services."
            }
        ]
    },
    {
        "display": true,
        "organization_title": "CWU Family Resource Center",
        "organization_img": "images/cwu_logo.jpg",
        "type": "Student Job",
        "jobs": [
            {
                "job_title": "Student Webmaster",
                "job_start": 2010,
                "job_end": 2011,
                "job_description": "My responsibilities included redesigning and updating the Family Resource Center's website. I also designed posters for campus events."
            }
        ]
    },
    {
        "display": true,
        "organization_title": "CWU Early Childhood Learning Center",
        "organization_img": "images/cwu_logo.jpg",
        "type": "Student Job",
        "jobs": [
            {
                "job_title": "Student Web Developer",
                "job_start": 2010,
                "job_end": 2012,
                "job_description": "I improved User Experience and made regular additions &amp; updates to the Early Childhood Learning Center's website."
            }
        ]
    },
    {
        "display": true,
        "organization_title": "Alaska Airlines IT Department",
        "organization_img": "images/alaska_logo.jpg",
        "type": "Internship",
        "jobs": [
            {
                "job_title": "Intern",
                "job_start": 2011,
                "job_description": "I worked with the IT Architecture Team as an intern. I helped to implement the Service Oriented Architecture inventory of SOAP/WPF Web Services."
            },
            {
                "job_title": "Intern",
                "job_start": 2012,
                "job_description": "I worked with the Ground Operations IT Team as an intern.  I created a C# Data Dashboard analyzing service tickets, displayed on a large screen in the office with the goal to increase team productivity and service response time. I queried a SQL database to get ticket metrics, wrote the C# server backend, and designed the HTML/CSS front-end."
            },
            {
                "job_title": "Temporary Software Developer",
                "job_start": 2013,
                "job_description": "After 2 years of internships I was offered a temporary summer software development position at Alaska Airlines. I developed team productivity tools, solutions in C# based on requirements and UX wireframes and tested system migration for a company wide Windows 7 upgrade."
            }
        ]
    },
    {
        "display": true,
        "organization_title": "CWU Organizational Effectiveness",
        "organization_img": "images/cwu_logo.jpg",
        "type": "Student Job",
        "jobs": [
            {
               "job_title": "Student Webmaster / Dashboard Developer",
                "job_start": 2015,
                "job_end": "June 2016",
                "job_description": "I worked to improve User Experience and create business intelligence reporting dashboards using Information Builders WebFocus.<br />Created JavaScript libraries that created reusable code in all dashboards.<br />Used Node.js to automate a lengthy data file download process." 
            }
        ]
    },
    {
        "display": false,
        "organization_title": "ArcZap",
        "organization_img": "images/arczap.jpg",
        "organization_img_rounded": true,
        "type": "Internship",
        "jobs": [
            {
               "job_title": "Web Developer Intern",
                "job_description": "I worked with this startup to assist the finishing of the beta, and launch of their online collaboration software. I worked to integrate Facebook API functionalities into their existing software. I helped develop server-side software to create a search engine of local events." 
            }
        ]       
    },
    {
        "display": true,
        "organization_title": "CWU Insitutional Effectiveness",
        "organization_img": "images/cwu_logo.jpg",
        "type": "Career",
        "jobs": [
            {
               "job_title": "Research Analyst 3",
                "job_start": "June 2016",
                "job_end": "Oct. 2017",
                "job_description": "<ul><li>Improve User Experience and User Interfaces for reporting dashboards, develop reports querying big data sets, and answer business intelligence questions with quantitative answers. Actively worked to develop my data driven intuition as well as skills in machine learning and predictive analytics (DataCamp). I created business intelligence reporting dashboards using Information Builders WebFocus.</li></ul>" 
            },
            {
               "job_title": "Data Warehouse Architect",
                "job_start": "Sept. 2017",
                "job_end": "Jan. 2018",
                "job_description": "<ul><li>Work with IT to design & create a new star schema data warehouse with regard to business need.</li><li>Work with IT to design & develop datasets necessary for a new suite of dashboard reporting tools (WebFocus).</li><li>Lead a small team of developers and outside consultants to use SAS to create ETL pipelines that warehouse official reporting data.</li><li>Use SSIS to create ETL pipelines for operational reporting data marts from multiple systems of record.</li><li>Develop new database structures to enhance reporting capabilities using my knowledge of business rules.</li></ul>"
            },
            {
               "job_title": "Data Warehouse Coordinator",
                "job_start": "Jan. 2018",
                "job_end": "Present",
                "job_description": "<ul><li>Using business knowledge, interface between stakeholders and data warehouse developers.</li><li>Create SAS Scripts to utilize official data warehouse to automate federal, state and 3rd party required reporting. (significant time/cost savings and improved consistency and accuracy)</li><li>Maintain SAS Reporting Data Warehouse System, develop new database objects.</li><li>Create high priority datasets to support university accreditation and longitudinal data research.</li><li>Won best paper 'Evolution of a Data Warehouse: System Approach' presented at Rocky Mountain Association of Institutional Research (RMAIR) & AIR National conference.</li></ul>" 
            }
        ]
    }
]